using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Caesar
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }
        //string text = "Осэхксае огюрхгаг. Стэг рм юкрзрэ хсис, зхс вагйхр сфкгхрар вэрцгэрд эг шрьксвлб вгабхл — чхс хс, зхс эдсхйаднрвгдцжд шрьксвжд тдэеир, йхсрх рц юсыврхейы, йсвдкщдээс сфклщгх осэхксае огюрхгаг — хс дйхе юкгвраг рар мгосэж, осхскжд в исйлтгкйхвд кгййзрхгэж эг сикгэрздэрд хдздэры шдээсйхдъ, огюрхгаг, йкдтйхв  - ого рм йхкгэж, хго р в эдд. Эгагигы сикгэрздэры эг фгэор, рэвдйхршрр р х. т., исйлтгкйхвс цсндх люкгваыхе чхрцр юсхсогцр. Юкр сюкдтдадээжу сфйхсыхдаейхвгу фрхосрэ адиос цсндх сфсъхр чхр сикгэрздэры. Цснэс юксйхс олюрхе фрхосрэж мг тдэеир в стэсъ йхкгэд, юдкдвдйхр ру в тклилб чадохксээжц йюсйсфсц, г мгхдц хскисвгхе рцр в хкдхедъ. Чхс юсмвсаыдх вжвстрхе огюрхгаж рм йхкгэж р ввстрхе ру в йхкгэл. Юсйосаеол йкдтйхвг в чадохксээсъ ьскцд цсилх адиос юкдстсадвгхе икгэршж р эд цсилх осэхксарксвгхейы, юкгврхдаейхвс, ндагбпдд сйлпдйхваыхе осэхксае огюрхгаг в цркд, итд дйхе фрхосрэ, тсанэс юсюжхгхейы схсквгхе фрхосрэ сх цдйхэсъ фгэосвйосъ йрйхдцж, мгвымгээсъ эг хкгтршрсээсъ вгабхд. Чхс йтдагдх фдййцжйадээжц юдкдвст фсаещру йлцц тдэди в фрхосрэж рар фрхосрэсв в сфжзэжд тдэеир. Дйхе юкрцдкж йхкгэ, осхскжд хго р юсйхлюгбх — эгюкрцдк, Орхгъ. В Орхгд ввстыхйы вйд фсадд йхксирд цдкж таы схоабздэры фрхосрэг сх исйлтгкйхвдээсъ фгэосвйосъ йрйхдцж эг хкгтршрсээжу тдэеигу. Юкдйхлюэсйхе. Тклигы юкрзрэг фдйюсосъйхвг вагйхдъ с эдсхйаднрвгдцсъ вгабхд — чхс хс, зхс сэг мгцдхэс люкспгдх йсвдкщдэрд сюкдтдаёээжу юкдйхлюадэръ — в згйхэсйхр юсурпдэръ р вжцсигхдаейхвг. Хгорд юкдйхлюадэры олтг адизд йсвдкщгхе, дйар юагхднр трйхгэшрсээжд р гэсэрцэжд. Йраж юкгвсюскытог, эгюкрцдк, згйхс юсагигбхйы эг цсцдэх юдкдтгзр тдэди ндкхвсъ (рар дд йдцедъ) юкдйхлюэрогц. Дйар нд тдэеир юдкдтгвгхе юс чадохксээсъ юсзхд р гэсэрцэс, йхгэсврхйы искгмтс йаснэдд схйадтрхе чхр тдэеир. Тклисъ юкрцдк — врклй окрюхсасодк, осхскжъ мгщрьксвжвгдх ьгъаж ндкхвж р хкдфлдх вжолю в фрхосрэгу рар тклиру чадохксээжу тдэеигу мг тдщрьксвол. Ого юкдйхлюадэрд, хго р вжюагхг вжолюг сйлпдйхваыбхйы трйхгэшрсээс. Хсзэс хгонд лоасэдэрд сх люагхж эгасисв йхгэсврхйы адизд, дйар тдэеир цснэс юдкдвстрхе эдсхйаднрвгдцжцр хкгэмгошрыцр, осхскжд эдаемы юкрвымгхе о сюкдтдаёээсцл здасвдол. Эгосэдш, юкстгнг мгюкдпдээсъ юкстлошрр йхгэсврхйы юсхдэшргаеэс юкспд, дйар юдкдвст йкдтйхв йсвдкщгдхйы трйхгэшрсээс р эд юксустрх здкдм кдиларклдцсд лзкднтдэрд. В чхсц кгмтдад цж юсисвскрц сф схцжвгэрр тдэди р юкгвра юс юксхрвстдъйхврб чхсцл ывадэрб, осхскжд ввдар вагйхр (сйсфдээс гцдкрогэйорд), р осхскжд варыбх эг ьркцж, йвымгээжд й фрхосрэсц. Шдае хгосъ юсархрор — юкдтсхвкгпдэрд вжвстг фсаещру йлцц тдэди мгклфдн арфс вжвдтдэры ру рм хдэр р адигармгшрр фдм сфэгклндэры. Кгэдд цж сфйлнтгар осэхксае огюрхгаг, осхскжъ хгонд йалнрх таы юкдтсхвкгпдэры юдкдйдздэры тдэеигцр икгэрш — в эдосхскжу йалзгыу исйлтгкйхвс йцсхкрх эг чхс йюсосъэс, эс усздх мэгхе, охс р осцл юдкдйжагдх тдэеир, р схолтг сэр вмыарйе. ЮСТ эгшдадэс эг лйаснэдэрд сюкдтдадээжу юкдйхлюадэръ — в сйсфдээсйхр скигэрмсвгээжу. СЮИ згйхс юсалзгбх сиксцэжд тдэеир р ндагбх ру юдкдвдйхр в тклирд цдйхг, эс эд усхых сфяыйэыхе, схолтг сэр ру вмыар — схйбтг р ндагэрд вжвстрхе ру мг клфдн. Хгонд сэр цсилх юсалзрхе чхр тдэеир эдмгосээс р схцжхе ру, зхсфж цснэс фжас юсолюгхе йюскхрвэжд цгщрэж, сиксцэжд тсцг рар зхс листэс дпд. ЮСТ йхгврх йвсдъ шдаеб лйаснэрхе вйё чхс, р юкр чхсц люксйхрхе юсрцол хду, охс чхс тдагдх. Мэгъ йвсдис оардэхг. Стэс рм юкгвра ЮСТ - «мэгъ йвсдис оардэхг» (МЙО). Юстксфэсйхр чхсъ юсархрор йаснэсвгхж р мгврйых сх йхкгэж, эс сйэсвэгы ртды чхсъ юсархрор — хкдфсвгэрд о юкдтюкрыхрыц, мгэрцгбпрцйы тдэднэжц сфсксхсц, вжюсаэыхе хкр вртг тдъйхвръ: 1. Ртдэхрьрогшры р глхдэхрьрогшры оардэхсв — сфдйюдзрхе эдоръ цдугэрмц юстхвдкнтдэры арзэсйхр, р хс, зхс мгывадээгы арзэсйхе йссхвдхйхвлдх кдгаеэсъ. Здасвдо эд цсндх юксйхс мгъхр р эгмвгхейы Тнсэсц Йцрхсц, юкснрвгбпрц юс гткдйл Иагвэгы ларшг, тсц 1. Таы йсвдкщдэры сюкдтдадээжу тдъйхвръ дцл юкртёхйы юсогмгхе югйюскх, осхскжъ юсхсц юксвдкых. 2. Сшдэог крйосвгээсйхр оардэхг — сюкдтдархе, огосвг вдксыхэсйхе хсис, зхс оардэх лзгйхвлдх в эдмгосээжу юкдтюкрыхрыу. Чхг сшдэог юксвстрхйы эг сйэсвгэрр юсвдтдэры оардэхг — ого тгвэс сэр й осцюгэрдъ вцдйхд, эгйосаеос рмвдйхдэ сэ в йссфпдйхвд р цэсисд тклисд. Юкгвраг МЙО сфжзэс хкдфлбх, зхсфж лзгйхвлбпрд в юксикгццд осцюгэрр фсадд вэрцгхдаеэс йадтрар мг оардэхгцр, фрмэдй осхскжу йзрхгдхйы крйосвгээжц. 3. Юсрйо гэсцгаеэсйхр в юсвдтдэрр — хс дйхе, юсвдтдэрд, осхсксд цсндх йвртдхдаейхвсвгхе с юсюжхогу схцжвгхе тдэеир рар юкдйхлюэсъ тдыхдаеэсйхр. МЙО сфжзэс хкдфлдх схогмжвгхе в сфйалнрвгэрр ьркцгц, зер оардэхж вжиаытых юстсмкрхдаеэс арфс эд цсилх тсйхгхсзэс вэыхэс йсиагйэс юкгврагц ртдэхрьршрксвгхе йдфы рар йвсб сфагйхе мгэыхсйхр. Сфымгхдаеэжд схзёхж. В ЙЩГ тдъйхвлбх хкдфсвгэры сф сфымгхдаеэсъ схзёхэсйхр, с осхскжу йхсрх люсцыэлхе. Осцюгэрр рм йгцжу кгмэжу йдохсксв чосэсцрор тсанэж схзрхжвгхейы с хкгэмгошрыу в вгабхд эг йлццл йвжщд 10 000 тсаагксв. Сэр тсанэж мгюсаэыхе хго эгмжвгдцжъ схзёх с вгабхэсъ хкгэмгошрр й сюрйгэрдц хкгэмгошрр р тгээжцр с юсалзгхдад. Хгонд дйхе хкдфсвгэры юс глхдэхрьрогшрр чхсъ йхсксэж. Юсйад чхсис рэьскцгшры юсйхлюгдх в юкгврхдаейхвдээжд фгмж тгээжу р цсндх гэгармрксвгхейы эг юкдтцдх югххдкэсв юсвдтдэры, йвртдхдаейхвлбпру сф схцжвгэрр тдэди. Осцюгэрр хгонд тсанэж эгфабтгхе мг оардэхгцр, осхскжд «йхклохлкрклбх» хкгэмгошрр вс рмфднгэрд юсюгтгэры юст чхр хкдфсвгэры — эгюкрцдк, йсвдкщгбх эдйосаеос юдкдвстсв в 9000 тсаагксв, зхсфж сфсъхр хкдфсвгэрд й 10000.";
        string ALPHABET = "абвгдеёжзийклмнопрстуфхцчшщьыъэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ";
        //string text2= "Осэхксае огюрхгаг. Стэг рм юкрзрэ хсис, зхс вагйхр сфкгхрар вэрцгэрд эг шрьксвлб вгабхл — чхс хс, зхс эдсхйаднрвгдцжд шрьксвжд тдэеир, йхсрх рц юсыврхейы, йсвдкщдээс сфклщгх осэхксае огюрхгаг — хс дйхе юкгвраг рар мгосэж, осхскжд в исйлтгкйхвд кгййзрхгэж эг сикгэрздэрд хдздэры шдээсйхдъ, огюрхгаг, йкдтйхв  - ого рм йхкгэж, хго р в эдд. Эгагигы сикгэрздэры эг фгэор, рэвдйхршрр р х. т., исйлтгкйхвс цсндх люкгваыхе чхрцр юсхсогцр. Юкр сюкдтдадээжу сфйхсыхдаейхвгу фрхосрэ адиос цсндх сфсъхр чхр сикгэрздэры. Цснэс юксйхс олюрхе фрхосрэж мг тдэеир в стэсъ йхкгэд, юдкдвдйхр ру в тклилб чадохксээжц йюсйсфсц, г мгхдц хскисвгхе рцр в хкдхедъ. Чхс юсмвсаыдх вжвстрхе огюрхгаж рм йхкгэж р ввстрхе ру в йхкгэл. Юсйосаеол йкдтйхвг в чадохксээсъ ьскцд цсилх адиос юкдстсадвгхе икгэршж р эд цсилх осэхксарксвгхейы, юкгврхдаейхвс, ндагбпдд сйлпдйхваыхе осэхксае огюрхгаг в цркд, итд дйхе фрхосрэ, тсанэс юсюжхгхейы схсквгхе фрхосрэ сх цдйхэсъ фгэосвйосъ йрйхдцж, мгвымгээсъ эг хкгтршрсээсъ вгабхд. Чхс йтдагдх фдййцжйадээжц юдкдвст фсаещру йлцц тдэди в фрхосрэж рар фрхосрэсв в сфжзэжд тдэеир. Дйхе юкрцдкж йхкгэ, осхскжд хго р юсйхлюгбх — эгюкрцдк, Орхгъ. В Орхгд ввстыхйы вйд фсадд йхксирд цдкж таы схоабздэры фрхосрэг сх исйлтгкйхвдээсъ фгэосвйосъ йрйхдцж эг хкгтршрсээжу тдэеигу. Юкдйхлюэсйхе. Тклигы юкрзрэг фдйюсосъйхвг вагйхдъ с эдсхйаднрвгдцсъ вгабхд — чхс хс, зхс сэг мгцдхэс люкспгдх йсвдкщдэрд сюкдтдаёээжу юкдйхлюадэръ — в згйхэсйхр юсурпдэръ р вжцсигхдаейхвг. Хгорд юкдйхлюадэры олтг адизд йсвдкщгхе, дйар юагхднр трйхгэшрсээжд р гэсэрцэжд. Йраж юкгвсюскытог, эгюкрцдк, згйхс юсагигбхйы эг цсцдэх юдкдтгзр тдэди ндкхвсъ (рар дд йдцедъ) юкдйхлюэрогц. Дйар нд тдэеир юдкдтгвгхе юс чадохксээсъ юсзхд р гэсэрцэс, йхгэсврхйы искгмтс йаснэдд схйадтрхе чхр тдэеир. Тклисъ юкрцдк — врклй окрюхсасодк, осхскжъ мгщрьксвжвгдх ьгъаж ндкхвж р хкдфлдх вжолю в фрхосрэгу рар тклиру чадохксээжу тдэеигу мг тдщрьксвол. Ого юкдйхлюадэрд, хго р вжюагхг вжолюг сйлпдйхваыбхйы трйхгэшрсээс. Хсзэс хгонд лоасэдэрд сх люагхж эгасисв йхгэсврхйы адизд, дйар тдэеир цснэс юдкдвстрхе эдсхйаднрвгдцжцр хкгэмгошрыцр, осхскжд эдаемы юкрвымгхе о сюкдтдаёээсцл здасвдол. Эгосэдш, юкстгнг мгюкдпдээсъ юкстлошрр йхгэсврхйы юсхдэшргаеэс юкспд, дйар юдкдвст йкдтйхв йсвдкщгдхйы трйхгэшрсээс р эд юксустрх здкдм кдиларклдцсд лзкднтдэрд. В чхсц кгмтдад цж юсисвскрц сф схцжвгэрр тдэди р юкгвра юс юксхрвстдъйхврб чхсцл ывадэрб, осхскжд ввдар вагйхр (сйсфдээс гцдкрогэйорд), р осхскжд варыбх эг ьркцж, йвымгээжд й фрхосрэсц. Шдае хгосъ юсархрор — юкдтсхвкгпдэрд вжвстг фсаещру йлцц тдэди мгклфдн арфс вжвдтдэры ру рм хдэр р адигармгшрр фдм сфэгклндэры. Кгэдд цж сфйлнтгар осэхксае огюрхгаг, осхскжъ хгонд йалнрх таы юкдтсхвкгпдэры юдкдйдздэры тдэеигцр икгэрш — в эдосхскжу йалзгыу исйлтгкйхвс йцсхкрх эг чхс йюсосъэс, эс усздх мэгхе, охс р осцл юдкдйжагдх тдэеир, р схолтг сэр вмыарйе. ЮСТ эгшдадэс эг лйаснэдэрд сюкдтдадээжу юкдйхлюадэръ — в сйсфдээсйхр скигэрмсвгээжу. СЮИ згйхс юсалзгбх сиксцэжд тдэеир р ндагбх ру юдкдвдйхр в тклирд цдйхг, эс эд усхых сфяыйэыхе, схолтг сэр ру вмыар — схйбтг р ндагэрд вжвстрхе ру мг клфдн. Хгонд сэр цсилх юсалзрхе чхр тдэеир эдмгосээс р схцжхе ру, зхсфж цснэс фжас юсолюгхе йюскхрвэжд цгщрэж, сиксцэжд тсцг рар зхс листэс дпд. ЮСТ йхгврх йвсдъ шдаеб лйаснэрхе вйё чхс, р юкр чхсц люксйхрхе юсрцол хду, охс чхс тдагдх. Мэгъ йвсдис оардэхг. Стэс рм юкгвра ЮСТ - «мэгъ йвсдис оардэхг» (МЙО). Юстксфэсйхр чхсъ юсархрор йаснэсвгхж р мгврйых сх йхкгэж, эс сйэсвэгы ртды чхсъ юсархрор — хкдфсвгэрд о юкдтюкрыхрыц, мгэрцгбпрцйы тдэднэжц сфсксхсц, вжюсаэыхе хкр вртг тдъйхвръ: 1. Ртдэхрьрогшры р глхдэхрьрогшры оардэхсв — сфдйюдзрхе эдоръ цдугэрмц юстхвдкнтдэры арзэсйхр, р хс, зхс мгывадээгы арзэсйхе йссхвдхйхвлдх кдгаеэсъ. Здасвдо эд цсндх юксйхс мгъхр р эгмвгхейы Тнсэсц Йцрхсц, юкснрвгбпрц юс гткдйл Иагвэгы ларшг, тсц 1. Таы йсвдкщдэры сюкдтдадээжу тдъйхвръ дцл юкртёхйы юсогмгхе югйюскх, осхскжъ юсхсц юксвдкых. 2. Сшдэог крйосвгээсйхр оардэхг — сюкдтдархе, огосвг вдксыхэсйхе хсис, зхс оардэх лзгйхвлдх в эдмгосээжу юкдтюкрыхрыу. Чхг сшдэог юксвстрхйы эг сйэсвгэрр юсвдтдэры оардэхг — ого тгвэс сэр й осцюгэрдъ вцдйхд, эгйосаеос рмвдйхдэ сэ в йссфпдйхвд р цэсисд тклисд. Юкгвраг МЙО сфжзэс хкдфлбх, зхсфж лзгйхвлбпрд в юксикгццд осцюгэрр фсадд вэрцгхдаеэс йадтрар мг оардэхгцр, фрмэдй осхскжу йзрхгдхйы крйосвгээжц. 3. Юсрйо гэсцгаеэсйхр в юсвдтдэрр — хс дйхе, юсвдтдэрд, осхсксд цсндх йвртдхдаейхвсвгхе с юсюжхогу схцжвгхе тдэеир рар юкдйхлюэсъ тдыхдаеэсйхр. МЙО сфжзэс хкдфлдх схогмжвгхе в сфйалнрвгэрр ьркцгц, зер оардэхж вжиаытых юстсмкрхдаеэс арфс эд цсилх тсйхгхсзэс вэыхэс йсиагйэс юкгврагц ртдэхрьршрксвгхе йдфы рар йвсб сфагйхе мгэыхсйхр. Сфымгхдаеэжд схзёхж. В ЙЩГ тдъйхвлбх хкдфсвгэры сф сфымгхдаеэсъ схзёхэсйхр, с осхскжу йхсрх люсцыэлхе. Осцюгэрр рм йгцжу кгмэжу йдохсксв чосэсцрор тсанэж схзрхжвгхейы с хкгэмгошрыу в вгабхд эг йлццл йвжщд 10 000 тсаагксв. Сэр тсанэж мгюсаэыхе хго эгмжвгдцжъ схзёх с вгабхэсъ хкгэмгошрр й сюрйгэрдц хкгэмгошрр р тгээжцр с юсалзгхдад. Хгонд дйхе хкдфсвгэры юс глхдэхрьрогшрр чхсъ йхсксэж. Юсйад чхсис рэьскцгшры юсйхлюгдх в юкгврхдаейхвдээжд фгмж тгээжу р цсндх гэгармрксвгхейы эг юкдтцдх югххдкэсв юсвдтдэры, йвртдхдаейхвлбпру сф схцжвгэрр тдэди. Осцюгэрр хгонд тсанэж эгфабтгхе мг оардэхгцр, осхскжд «йхклохлкрклбх» хкгэмгошрр вс рмфднгэрд юсюгтгэры юст чхр хкдфсвгэры — эгюкрцдк, йсвдкщгбх эдйосаеос юдкдвстсв в 9000 тсаагксв, зхсфж сфсъхр хкдфсвгэрд й 10000.";
        string frequencystring = "оеаинтсрвлкмдпуяыьгзбчйхжшюцщэфъё";//"оеаинтсрвлкмдпуяыьгзбчйхжшюцщэфъё";
                                                                     //string alphabet = "";

        string text = "Ачяруцдд, ачжчибг шуягхупж жуачг юживажвидичщуцдг, ечтыцб ючюжущткжй чжхгж ч рчечшиджгтйцчя рчщгегцдд. Нжу дцэчияуодк жуаыг рчюжвругж щ риущджгтйюжщгццбг лушб еуццбф д ячыгж ридщгюжд а цухутв иуюютгечщуцдк. Щ огтчя ыг жиглчщуцдк шущдюкж чж южиуцб. Цуюжчкъдя яб цдачдя члиушчя цг еуёя пидедхгюадф игачягцеуодм ч цгчлфчедячюжд рчечлцбф егмюжщдм д цг чрдюбщугя дф члиуш. Еуццчг члювыегцдг ридшщуцч еужй рчцкждг ч жчя, ауадг жиглчщуцдк цутусугж шуачцчеужгтйюжщч РЧЕ. Ютгевгж рчяцджй, хжч риущджгтйюжщу — ауа щ ЮЗУ, жуа д щ еивсдф южиуцуф, щчюридцдяупж риущдту РЧЕ аиумцг югийёшцч. Нжч цг жг риущдту, ачжчибг ячыцч шуричюжч цуивзужй д иушлдиужйюк, жчтйач гютд щтуюжд юч щигягцгя члиужкж цу нжч щцдяуцдг. Лджачдц-эдияб шуаибщутд — дцчсеу щигягццч, дцчсеу цуючщюгя. Ригеридцдяужгтгм уигюжчщбщутд д юуыутд щ жпийяв шу цгщбрчтцгцдг нждф риущдт. Нжч жуаук члтуюжй, щ ачжчичм риущджгтйюжщч игзджгтйцч д лгшыутчюжцч рчтйшвгжюк шуачцчя, д цгщуыцч, ауюугжюк егтчлджачдцу дтд щгъгюжщгццчм щутпжб. Риущджгтйюжщч дюрчтйшвгж нжд шуачцб ричждщ лджачдц-эдия ю жгф рчи, ауа шуягждтч, хжч лджачдц ечюжужчхцч вечлгц етк чжябщуцдк егцгс. Гютд щб фчжджг чжаибжй ющчм лдшцгю, хгигш ачжчибм лвевж ричфчеджй лчтйздг чльгяб егцгс, ютгевгж юцухуту рчючщгжчщужйюк ю пидюжчя, ачжчибм иушлдиугжюк щ нждф риущдтуф. У жгргий рикяч рчсчщчидя ч ютчщг цу лващв и — игсвтдичщуцдд. Игсвтдичщуцдг хуюжч дяггж евицвп игрвжуодп, чючлгццч юигед тплджгтгм лджачдцу. Члбхцч юхджупж, хжч игсвткжчи — нжч лпичаиуждхгюаук яуздцу, ачжчиук цдхгсч цг юябютдж щ жчя, хжч нжч шу лдшцгю д хгя чц шуцкж, щтгшугж д щюё юрвжбщугж. Нжч жчтйач члвшу, нжч стврч д лгююябютгццч. Жуадг ечщчеб шщвхуж ечщчтйцч хуюжч, д дф тгсач рчцкжй — шухуюжвп чцд юриущгетдщб. Цч а нжчяв яб щчшщиуъужйюк лчтйзг цг лвегя. Щ еуццчя иушегтг яб рчсчщчидя ч жчя, рчхгяв игсвтдичщуцдг дцчсеу лбщугж чриущеуцч, рчюачтйав нжчж уисвягцж шухуюжвп чаушбщугжюк цгрчцкжбя. Счщчик рч риущег, жч, хжч яб цу ричжкыгцдд лчтйзгм хуюжд нжчм тгаодд счщчидя ч жчя, рчхгяв игсвтдичщуцдг ячыгж лбжй фчичзгм щгъйп, гъё цг ечтыцч юхджужйюк урчтчсдгм здичачсч игсвтдичщуцдк. Яб егтугя нжч рчжчяв, хжч фчждя виущцчщгюджй здичач иуюричюжиуцёццбг щ юччлъгюжщг ечщчеб ч жчя, хжч игсвтдичщуцдг — нжч щюгсеу ртчфч дтд стврч щ юуячм ющчгм ювжд. Чюцчщцчм ечщче щ юрчиг ч игсвтдичщуцдд шщвхдж жуа: ачсеу ибцад руеупж д щбеупж ртчфвп ечфчецчюжй, ю хгя ючстуюцб щюг вхуюжцдад, жчсеу игсвтдичщуцдг ячыгж втуеджй нжв ричлтгяв. Жуа хжч чюцчщцук дегк щ ечщчеуф шу игсвтдичщуцдг, гютд чцд щччлъг цвыцб, ючюжчдж щ жчя, хжч ибцад цг щюгсеу ридцчюкж ыгтугябм игшвтйжуж. Луиуфчтау. Рчсчщчидя ч жчя, ауа ибцча ячыгж цг юриущджйюк ю иулчжчм цу атуююдхгюачя ридягиг рче цушщуцдгя «луиуфчтау» (щ чидсдцутг lemons market – цу ютгцсг ибцча ричеуыд рчегиыуццбф ущжчячлдтгм юч юаибжбяд цгечюжужауяд — ридя.рги). Ригеюжущдя юглг, хжч гюжй цгадм ибцча «щдеыгжчщ» - цгачгсч жчщуиу, ачжчибм рчаврупж д ричеупж. Юауыгя, щдеыгжб лбщупж фчичзгсч д ртчфчсч аухгюжщу. Щбючачаухгюжщгццбм щдеыгж цгюачтйач ечичыг ричдшщчеджй, цч чц цуяцчсч твхзг етк жчсч, ажч гсч аврдж. Жуа хжч рчавружгтд ригерчхджупж щбючачаухгюжщгццбг щдеыгжб. Гютд ибцча иулчжугж фчичзч, гютд чц щ начцчядхгюачя юябютг нээгаждщгц, цу цёя лвевж ригеюжущтгцб щ чюцчщцчя щбючачаухгюжщгццбг щдеыгжб. Нжч ричдюфчедж рчжчяв, хжч фчжк жуачм щдеыгж д ечичыг, рчавружгтй лвегж ригерчхджужй дягццч гсч, д шуртуждж шу цгсч лчтйзг. Жуа хжч ю дшщгюжцбяд чсчщчиауяд щбфче в ибцау лвегж вюргзцбя. Ю еивсчм южчичцб, ечрвюждя, хжч рчавружгтд цг ячсвж чжтдхджй фчичздм щдеыгж чж ртчфчсч еч рчаврад. Атуююдхгюадм ридяги — нжч рчегиыуццчг ущжч. Щб юячжиджг цу жуавп яуздцв, д чцу щбсткедж ечщчтйцч фчичзч, цч цу юуячя егтг щб цг ячыгжг ю вщгигццчюжйп юаушужй, хжч цушущжиу чцу цг ютчяугжюк, дтд хжч ричютвыдж гъё ечтсчг щигяк. Едтги цущгицкау щ авиюг, хжч яуздцу лиуачщуццук, цч щб, ауа рчавружгтй, щике тд шуягжджг иушцдов. Рчевяугя ч жчя, хжч ридщчедж тпегм цу луиуфчтав. Ауа рчавружгтй, щб цг фчжджг ртужджй тдзцгсч шу щбючачаухгюжщгццбм щдеыгж — ричюжч рчжчяв, хжч цг щдеджг иушцдоб. Еуыг гютд едтги аткцёжюк, хжч яуздцу лгшвригхцу, д ргигртужджй цвыцч жчтйач южч ечттуичщ, в щую цгж югийёшцбф чюцчщуцдм гяв щгиджй. Щ игшвтйжужг ричдшщчеджгтд цг рчтвхупж ечрчтцджгтйцчм ридлбтд шу ричеуыв щбючачаухгюжщгццчсч щдеыгжу — цучлчичж, чцд жгиркж влбжад, ричеущук жуадг щдеыгжб, жуа ауа ричдшщчеджй гсч ечичыг, у ечрчтцджгтйцбф егцгс чцд цг ридцчюдж. Рчнжчяв ибцча шуюжигщугж щ ючюжчкцдд, ачсеу ричдшщчекжюк жчтйач цдшачаухгюжщгццбг щдеыгжб, ачжчибяд рчавружгтд юиущцджгтйцч цгечщчтйцб.";
        string text2 = "Ачяруцдд, ачжчибг шуягхупж жуачг юживажвидичщуцдг, ечтыцб ючюжущткжй чжхгж ч рчечшиджгтйцчя рчщгегцдд. Нжу дцэчияуодк жуаыг рчюжвругж щ риущджгтйюжщгццбг лушб еуццбф д ячыгж ридщгюжд а цухутв иуюютгечщуцдк. Щ огтчя ыг жиглчщуцдк шущдюкж чж южиуцб. Цуюжчкъдя яб цдачдя члиушчя цг еуёя пидедхгюадф игачягцеуодм ч цгчлфчедячюжд рчечлцбф егмюжщдм д цг чрдюбщугя дф члиуш. Еуццчг члювыегцдг ридшщуцч еужй рчцкждг ч жчя, ауадг жиглчщуцдк цутусугж шуачцчеужгтйюжщч РЧЕ. Ютгевгж рчяцджй, хжч риущджгтйюжщу — ауа щ ЮЗУ, жуа д щ еивсдф южиуцуф, щчюридцдяупж риущдту РЧЕ аиумцг югийёшцч. Нжч цг жг риущдту, ачжчибг ячыцч шуричюжч цуивзужй д иушлдиужйюк, жчтйач гютд щтуюжд юч щигягцгя члиужкж цу нжч щцдяуцдг. Лджачдц-эдияб шуаибщутд — дцчсеу щигягццч, дцчсеу цуючщюгя. Ригеридцдяужгтгм уигюжчщбщутд д юуыутд щ жпийяв шу цгщбрчтцгцдг нждф риущдт. Нжч жуаук члтуюжй, щ ачжчичм риущджгтйюжщч игзджгтйцч д лгшыутчюжцч рчтйшвгжюк шуачцчя, д цгщуыцч, ауюугжюк егтчлджачдцу дтд щгъгюжщгццчм щутпжб. Риущджгтйюжщч дюрчтйшвгж нжд шуачцб ричждщ лджачдц-эдия ю жгф рчи, ауа шуягждтч, хжч лджачдц ечюжужчхцч вечлгц етк чжябщуцдк егцгс. Гютд щб фчжджг чжаибжй ющчм лдшцгю, хгигш ачжчибм лвевж ричфчеджй лчтйздг чльгяб егцгс, ютгевгж юцухуту рчючщгжчщужйюк ю пидюжчя, ачжчибм иушлдиугжюк щ нждф риущдтуф. У жгргий рикяч рчсчщчидя ч ютчщг цу лващв и — игсвтдичщуцдд. Игсвтдичщуцдг хуюжч дяггж евицвп игрвжуодп, чючлгццч юигед тплджгтгм лджачдцу. Члбхцч юхджупж, хжч игсвткжчи — нжч лпичаиуждхгюаук яуздцу, ачжчиук цдхгсч цг юябютдж щ жчя, хжч нжч шу лдшцгю д хгя чц шуцкж, щтгшугж д щюё юрвжбщугж. Нжч жчтйач члвшу, нжч стврч д лгююябютгццч. Жуадг ечщчеб шщвхуж ечщчтйцч хуюжч, д дф тгсач рчцкжй — шухуюжвп чцд юриущгетдщб. Цч а нжчяв яб щчшщиуъужйюк лчтйзг цг лвегя. Щ еуццчя иушегтг яб рчсчщчидя ч жчя, рчхгяв игсвтдичщуцдг дцчсеу лбщугж чриущеуцч, рчюачтйав нжчж уисвягцж шухуюжвп чаушбщугжюк цгрчцкжбя. Счщчик рч риущег, жч, хжч яб цу ричжкыгцдд лчтйзгм хуюжд нжчм тгаодд счщчидя ч жчя, рчхгяв игсвтдичщуцдг ячыгж лбжй фчичзгм щгъйп, гъё цг ечтыцч юхджужйюк урчтчсдгм здичачсч игсвтдичщуцдк. Яб егтугя нжч рчжчяв, хжч фчждя виущцчщгюджй здичач иуюричюжиуцёццбг щ юччлъгюжщг ечщчеб ч жчя, хжч игсвтдичщуцдг — нжч щюгсеу ртчфч дтд стврч щ юуячм ющчгм ювжд. Чюцчщцчм ечщче щ юрчиг ч игсвтдичщуцдд шщвхдж жуа: ачсеу ибцад руеупж д щбеупж ртчфвп ечфчецчюжй, ю хгя ючстуюцб щюг вхуюжцдад, жчсеу игсвтдичщуцдг ячыгж втуеджй нжв ричлтгяв. Жуа хжч чюцчщцук дегк щ ечщчеуф шу игсвтдичщуцдг, гютд чцд щччлъг цвыцб, ючюжчдж щ жчя, хжч ибцад цг щюгсеу ридцчюкж ыгтугябм игшвтйжуж. Луиуфчтау. Рчсчщчидя ч жчя, ауа ибцча ячыгж цг юриущджйюк ю иулчжчм цу атуююдхгюачя ридягиг рче цушщуцдгя «луиуфчтау» (щ чидсдцутг lemons market – цу ютгцсг ибцча ричеуыд рчегиыуццбф ущжчячлдтгм юч юаибжбяд цгечюжужауяд — ридя.рги). Ригеюжущдя юглг, хжч гюжй цгадм ибцча «щдеыгжчщ» - цгачгсч жчщуиу, ачжчибм рчаврупж д ричеупж. Юауыгя, щдеыгжб лбщупж фчичзгсч д ртчфчсч аухгюжщу. Щбючачаухгюжщгццбм щдеыгж цгюачтйач ечичыг ричдшщчеджй, цч чц цуяцчсч твхзг етк жчсч, ажч гсч аврдж. Жуа хжч рчавружгтд ригерчхджупж щбючачаухгюжщгццбг щдеыгжб. Гютд ибцча иулчжугж фчичзч, гютд чц щ начцчядхгюачя юябютг нээгаждщгц, цу цёя лвевж ригеюжущтгцб щ чюцчщцчя щбючачаухгюжщгццбг щдеыгжб. Нжч ричдюфчедж рчжчяв, хжч фчжк жуачм щдеыгж д ечичыг, рчавружгтй лвегж ригерчхджужй дягццч гсч, д шуртуждж шу цгсч лчтйзг. Жуа хжч ю дшщгюжцбяд чсчщчиауяд щбфче в ибцау лвегж вюргзцбя. Ю еивсчм южчичцб, ечрвюждя, хжч рчавружгтд цг ячсвж чжтдхджй фчичздм щдеыгж чж ртчфчсч еч рчаврад. Атуююдхгюадм ридяги — нжч рчегиыуццчг ущжч. Щб юячжиджг цу жуавп яуздцв, д чцу щбсткедж ечщчтйцч фчичзч, цч цу юуячя егтг щб цг ячыгжг ю вщгигццчюжйп юаушужй, хжч цушущжиу чцу цг ютчяугжюк, дтд хжч ричютвыдж гъё ечтсчг щигяк. Едтги цущгицкау щ авиюг, хжч яуздцу лиуачщуццук, цч щб, ауа рчавружгтй, щике тд шуягжджг иушцдов. Рчевяугя ч жчя, хжч ридщчедж тпегм цу луиуфчтав. Ауа рчавружгтй, щб цг фчжджг ртужджй тдзцгсч шу щбючачаухгюжщгццбм щдеыгж — ричюжч рчжчяв, хжч цг щдеджг иушцдоб. Еуыг гютд едтги аткцёжюк, хжч яуздцу лгшвригхцу, д ргигртужджй цвыцч жчтйач южч ечттуичщ, в щую цгж югийёшцбф чюцчщуцдм гяв щгиджй. Щ игшвтйжужг ричдшщчеджгтд цг рчтвхупж ечрчтцджгтйцчм ридлбтд шу ричеуыв щбючачаухгюжщгццчсч щдеыгжу — цучлчичж, чцд жгиркж влбжад, ричеущук жуадг щдеыгжб, жуа ауа ричдшщчеджй гсч ечичыг, у ечрчтцджгтйцбф егцгс чцд цг ридцчюдж. Рчнжчяв ибцча шуюжигщугж щ ючюжчкцдд, ачсеу ричдшщчекжюк жчтйач цдшачаухгюжщгццбг щдеыгжб, ачжчибяд рчавружгтд юиущцджгтйцч цгечщчтйцб.";
        private void button1_Click(object sender, EventArgs e)
        {
            textBox1.Text = text;
        }

        private void button2_Click(object sender, EventArgs e)
        {
            int[] frequency = new int[33];//исходная
            int[] frequency2 = new int[33];//отсортированная

            for (int i = 0; i < text.Length; i++)
                for (int j = 0; j < ALPHABET.Length - 33; j++)
                {
                    if (text[i] == ALPHABET[j] | text[i] == ALPHABET[j + 33])
                    {
                        frequency[j]++;
                        break;
                    }
                }

            for (int i = 0; i < frequency.Length; i++)
                frequency2[i] = frequency[i];

            for (int i = 0; i < frequency2.Length-1; i++)
                for (int j = i + 1; j < frequency2.Length; j++)
                    if (frequency2[j] > frequency2[i])
                    {
                        int temp = frequency2[j];
                        frequency2[j] = frequency2[i];
                        frequency2[i] = temp;
                    }

            for(int i=0;i<frequency.Length;i++)
                for(int j=0;j<frequency.Length;j++)
                    if(frequency2[i]==frequency[j])
                    {
                        for(int count=0;count<text.Length;count++)
                            if(text[count]==ALPHABET[j] | text[count] == ALPHABET[j+33])
                                text2 = text2.Remove(count, 1).Insert(count, frequencystring[i].ToString());
                        frequency[j] = -1;
                        break;
                    }

            textBox1.Text = text2.ToString();
        }

        private void button3_Click(object sender, EventArgs e)
        {
            string text3 = text2;
            for (int i = 0; i < text2.Length; i++)
            {
                if (text2[i] == 'р')
                    text3 = text3.Remove(i, 1).Insert(i, 'в'.ToString());
                if (text2[i] == 'я')
                    text3 = text3.Remove(i, 1).Insert(i, 'ы'.ToString());
                if (text2[i] == 'н')
                    text3 = text3.Remove(i, 1).Insert(i, 'и'.ToString());
                if (text2[i] == 'а')
                    text3 = text3.Remove(i, 1).Insert(i, 'е'.ToString());
                if (text2[i] == 'и')
                    text3 = text3.Remove(i, 1).Insert(i, 'а'.ToString());
                if (text2[i] == 'е')
                    text3 = text3.Remove(i, 1).Insert(i, 'т'.ToString());
                if (text2[i] == 'б')
                    text3 = text3.Remove(i, 1).Insert(i, 'г'.ToString());
                if (text2[i] == 'ы')
                    text3 = text3.Remove(i, 1).Insert(i, 'ь'.ToString());
                if (text2[i] == 'ч')
                    text3 = text3.Remove(i, 1).Insert(i, 'я'.ToString());
                if (text2[i] == 'т')
                    text3 = text3.Remove(i, 1).Insert(i, 'н'.ToString());
                if (text2[i] == 'п')
                    text3 = text3.Remove(i, 1).Insert(i, 'м'.ToString());
                if (text2[i] == 'м')
                    text3 = text3.Remove(i, 1).Insert(i, 'п'.ToString());
                if (text2[i] == 'с')
                    text3 = text3.Remove(i, 1).Insert(i, 'р'.ToString());
                if (text2[i] == 'в')
                    text3 = text3.Remove(i, 1).Insert(i, 'с'.ToString());
                if (text2[i] == 'ь')
                    text3 = text3.Remove(i, 1).Insert(i, 'ч'.ToString());
                if (text2[i] == 'ц')
                    text3 = text3.Remove(i, 1).Insert(i, 'ш'.ToString());
                if (text2[i] == 'г')
                    text3 = text3.Remove(i, 1).Insert(i, 'б'.ToString());
                if (text2[i] == 'ё')
                    text3 = text3.Remove(i, 1).Insert(i, 'ъ'.ToString());
                if (text2[i] == 'ш')
                    text3 = text3.Remove(i, 1).Insert(i, 'ю'.ToString());
                if (text2[i] == 'й')
                    text3 = text3.Remove(i, 1).Insert(i, 'ж'.ToString());
                if (text2[i] == 'ю')
                    text3 = text3.Remove(i, 1).Insert(i, 'э'.ToString());
                if (text2[i] == 'ъ')
                    text3 = text3.Remove(i, 1).Insert(i, 'ф'.ToString());
                if (text2[i] == 'ж')
                    text3 = text3.Remove(i, 1).Insert(i, 'й'.ToString());
                if (text2[i] == 'ф')
                    text3 = text3.Remove(i, 1).Insert(i, 'ц'.ToString());
                if (text2[i] == 'щ')
                    text3 = text3.Remove(i, 1).Insert(i, 'ё'.ToString());
                if (text2[i] == 'э')
                    text3 = text3.Remove(i, 1).Insert(i, 'щ'.ToString());
            }
            //for (int i = 0; i < text2.Length; i++)
            //{
            //    if (text2[i] == 'щ')
            //        text3 = text3.Remove(i, 1).Insert(i, "щ/////".ToString());
            //}
            textBox1.Text = text3.ToString();
            text2 = text3;
        }

        private void button4_Click(object sender, EventArgs e)
        {
            text2 = text2.Remove(0, 1).Insert(0, 'К'.ToString());
            for (int i=0;i<text2.Length-5;i++)
                if(text2[i]=='.' & text2[i+1]==' ')
                    for(int j=0;j<ALPHABET.Length-33;j++)
                        if(ALPHABET[j]==text2[i+2])
                        {
                            text2 = text2.Remove(i+2, 1).Insert(i+2, ALPHABET[j+33].ToString());
                            break;
                        }
            textBox1.Text = text2.ToString();
        }
    }
}
